#include "fin.h"
void add()                                                 //增加商品函数
{
	system("cls");
	printf("\n");
	printf("\t\t\t\t     ---------------------------------------------\n");
	printf("\t\t\t\t     -----------------商品增加--------------------\n");
	printf("\t\t\t\t     ---------------------------------------------\n\n");
	printf("\t\t\t\t     |请输入要增加的商品信息\n");
	printf("\t\t\t\t     |商品编号："); 
    scanf("%s",A[n].num);
    printf("\t\t\t\t     |商品名称：");
    scanf("%s",A[n].name);
    printf("\t\t\t\t     |商品价格：");
    scanf("%f",&A[n].price);
    printf("\t\t\t\t     |商品库存：");
    scanf("%d",&A[n].store);
    printf("\t\t\t\t     |商品已售：");
    scanf("%d",&A[n].sale);
    n++;
    system("cls");
    printf("\n");
    printf("\t\t   -----------------------------------------------------------------------\n");
	printf("\t\t   -----------------商品信息增加成功，请选择下一步操作--------------------\n");
	printf("\t\t   -----------------------------------------------------------------------\n\n");
    
}

