#include "fin.h"
void Del()                                                 //删除商品函数
{
   void save();
   int i,q;
   char num[100];
   int k=-1;

	system("cls");
	printf("\n");
	printf("\t\t\t\t     ---------------------------------------------\n");
	printf("\t\t\t\t     -----------------商品删除--------------------\n");
	printf("\t\t\t\t     ---------------------------------------------\n\n");
	printf("\t\t\t\t     |请输入商品编号：");
	scanf("%d",&q);
	q=q-1;
	{
    printf("\n");
    printf("\t        ---------------------------------------------------------------------------------\n");
	printf("\t        | 商品编号\t| 商品名称\t| 商品价格\t| 商品库存\t| 商品已售\t|\n");
	printf("\t        | %s\t        | %s\t| %.2f\t        | %d\t        | %d\t        |\n",A[q].num,A[q].name,A[q].price,A[q].store,A[q].sale);
    printf("\t        ---------------------------------------------------------------------------------\n\n");
    printf("\t\t\t\t     *请确认商品编号：");
    scanf("%s",&num);
    }
    for(i=0;i<100;i++)
    {
	    if(strcmp(num,A[i].num)==0)
		k=i;
	}
		if(k==-1){
			printf("\t\t\t\t     ");
		}
	for(i=k;i<n-1;i++)
	{
		A[i]=A[i+1];
	}

    n--;
    system("cls");
    printf("\n");
    printf("\t\t     -----------------------------------------------------------------------\n");
	printf("\t\t     -----------------商品信息删除成功，请选择下一步操作--------------------\n");
	printf("\t\t     -----------------------------------------------------------------------\n\n");
    

    save(); 
}
