#include "fin.h"
int login()
{
	char S1[100]={0},S2[100]={0};
	int i=0,j=0,a; 
	FILE*fp;                                               //定义文件类型指针
	if((fp=fopen("password.txt","r"))==NULL)               //用只读方式打开文件，如果文件存在就将文件的地址给fp,如果不存在fp为空指针
	{
		printf("cannot open this file;\n");
		exit(0);
	}
	while(!feof(fp))                                      //feof函数可以用来检测文件读写位置是否移到文件的末尾，如果是，则函数值为1，否则为0
	{
	fscanf(fp,"%s\n",B[i].yhm);  //用户名 
	fscanf(fp,"%s\n",B[i].mm);   //密码                   //用fscanf函数从文件中读取输入到结构体变量中
    i++;
	}
	n=i;
	fclose(fp);                                           //关闭文件以免误用     
	system("color 03");
	printf("\n");Sleep(50);
	printf("\t\t          __________________________________________________________________\n");Sleep(50);
	printf("\t\t         | _______________________________________________________________  |\n");Sleep(50);
	printf("\t\t         | |**************************************************************| |\n");Sleep(50);
	printf("\t\t         | |**                                                          **| | \n");Sleep(50);
	printf("\t\t         | |**            用     户     请     登     录                **| | \n");Sleep(50);
	printf("\t\t         | |**                                                          **| | \n");Sleep(50);
	printf("\t\t         | |**************************************************************| | \n");Sleep(50);
	printf("\t\t         | |______________________________________________________________| | \n");Sleep(50);
	printf("\t\t         |__________________________________________________________________|\n\n");Sleep(50);
	for(i=0;i<3;i++)
	{
		printf("\t\t          |请输入用户名：");
		gets(S1);
		printf("\t\t          |请输入登录密码：");
		gets(S2);
		for(j=0;j<10;j++)
		{
			if((strcmp(S1,B[j].yhm)==0)&&(strcmp(S2,B[j].mm)==0)&&(strcmp(S1,"\0")!=0)&&(strcmp(S2,"\0")!=0))
		  {
		  	system("cls");
		  	printf("\n");Sleep(50);
		  	printf("\t\t        --------------------------------------------------------------\n");Sleep(50);
			printf("\t\t        ----------------------密码正确，欢迎使用----------------------\n");Sleep(50);
			printf("\t\t        --------------------------------------------------------------\n");Sleep(50);
			j=0;
			break;
		  }
		}
		if(j==0)
		break;
		else
		printf("\n");
		printf("\t\t          *用户名或密码错误,你还有%d次机会！\n\n",2-i);
	}
		if(i==3)
		{
			printf("\n");
			printf("\t\t          *密码连续输错三次，系统自动退出!");
			exit(0); 
        } 
        system("color 02");
    if(strcmp(S1,"gly")==0)
    a=1;
    else
    a=2;
    return a;
}
